[
  {
    "id": "cmjy5nx4l0003or3cvvf2n4fq",
    "slug": "endustriyel-yay-uretiminde-kalite-kontrolun-onemi",
    "categoryId": "cmjy5nx4g0000or3c6cjfjrxt",
    "titleTr": "Endüstriyel Yay Üretiminde Kalite Kontrolün Önemi",
    "descriptionTr": "Yay üretiminde mikroskobik çatlaklardan yorulma testlerine kadar kalite kontrol süreçlerinin ürün ömrüne etkisi.",
    "contentTr": "\n        <h2>Kalite Neden Vazgeçilmezdir?</h2>\n        <p>Endüstriyel yaylar, otomotivden savunma sanayine kadar kritik makine parçalarının çalışmasını sağlayan görünmez kahramanlardır. Bir yayın kalitesi, sadece ölçüsel doğruluğu ile değil, malzeme yapısı ve ısıl işlem süreçlerinin başarısı ile ölçülür.</p>\n        \n        <h3>1. Malzeme Seçimi</h3>\n        <p>Kaliteli bir yay, doğru hammadde ile başlar. Karbon çelikleri, paslanmaz çelikler veya özel alaşımlar... Kullanılacak alanın sıcaklığığı, korozyon riski ve yük miktarı malzeme seçimini belirler.</p>\n        \n        <h3>2. Isıl İşlem ve Menevişleme</h3>\n        <p>Yayların esneklik kazanması ve kırılganlığının giderilmesi için ısıl işlem hayati önem taşır. Yanlış sıcaklık veya süre, yayın ömrünü %80 oranında azaltabilir.</p>\n        \n        <h3>3. Yük ve Ömür Testleri</h3>\n        <p>Aktif Yay olarak, ürettiğimiz her partiyi bilgisayar destekli test cihazlarında (Load Testing) kontrolden geçiriyoruz. Yayların belirlenen yük altında ne kadar esnediği (yay katsayısı) ve kaç bin çevrimden sonra yorulma gösterdiği raporlanır.</p>\n        \n        <p>Sonuç olarak, kalite kontrol bir maliyet değil, müşteri memnuniyetinin ve güvenliğin garantisidir.</p>\n      ",
    "titleEn": "Importance of Quality Control in Industrial Spring Manufacturing",
    "descriptionEn": "The impact of quality control processes, from microscopic cracks to fatigue tests, on product life in spring manufacturing.",
    "contentEn": "\n        <h2>Why Quality is Indispensable?</h2>\n        <p>Industrial springs are the invisible heroes ensuring the operation of critical machinery parts from automotive to defense industries. The quality of a spring is measured not only by dimensional accuracy but also by the success of material structure and heat treatment processes.</p>\n        \n        <h3>1. Material Selection</h3>\n        <p>A quality spring starts with the right raw material. Carbon steels, stainless steels, or special alloys... The temperature of the usage area, corrosion risk, and load amount determine the material selection.</p>\n        \n        <h3>2. Heat Treatment and Tempering</h3>\n        <p>Heat treatment is vital for springs to gain elasticity and remove brittleness. Incorrect temperature or duration can reduce spring life by 80%.</p>\n        \n        <h3>3. Load and Life Cycle Tests</h3>\n        <p>As Aktif Yay, we check every batch we produce in computer-aided test devices (Load Testing). It is reported how much the springs stretch under the specified load (spring rate) and after how many thousand cycles they show fatigue.</p>\n        \n        <p>In conclusion, quality control is not a cost, but a guarantee of customer satisfaction and safety.</p>\n      ",
    "keywordsTr": "yay üretimi, kalite kontrol, load test, ısıl işlem, yay malzemesi",
    "keywordsEn": "spring manufacturing, quality control, load test, heat treatment, spring material",
    "canonicalUrl": null,
    "robots": "index, follow",
    "metaTitleTr": "Yay Üretiminde Kalite Kontrol - Aktif Yay",
    "metaDescriptionTr": "Endüstriyel yay üretiminde kalite standartları ve test süreçleri hakkında teknik inceleme.",
    "metaTitleEn": null,
    "metaDescriptionEn": null,
    "ogTitleTr": null,
    "ogDescriptionTr": null,
    "ogTitleEn": null,
    "ogDescriptionEn": null,
    "ogImage": null,
    "image": "https://images.unsplash.com/photo-1581091226825-a6a2a5aee158?auto=format&fit=crop&q=80&w=2070",
    "imageAltTr": "Laboratuvar ortamında yay kalite kontrol testi",
    "imageAltEn": "Spring quality control test in laboratory environment",
    "authorName": "Mühendislik Ekibi",
    "readingTime": 4,
    "isPublished": true,
    "viewCount": 125,
    "publishedAt": "2026-01-03T10:23:58.580Z",
    "createdAt": "2026-01-03T10:23:58.582Z",
    "updatedAt": "2026-01-03T10:23:58.582Z"
  },
  {
    "id": "cmjy5nx4o0005or3c9sd736or",
    "slug": "dogru-yay-secimi-nasil-yapilir",
    "categoryId": "cmjy5nx4g0000or3c6cjfjrxt",
    "titleTr": "Doğru Yay Seçimi Nasıl Yapılır? Kapsamlı Rehber",
    "descriptionTr": "Projeniz için basma yayı mı, çekme yayı mı lazım? Yay hesaplamalarında dikkat edilmesi gereken temel parametreler.",
    "contentTr": "\n        <h2>Hangi Yay Tipine İhtiyacınız Var?</h2>\n        <p>Mühendislik projelerinde doğru yay seçimi, mekanizmanın verimli çalışması için ilk adımdır. İşte yay tiplerine göre seçim kriterleri:</p>\n        \n        <ul>\n            <li><strong>Basma Yaylar (Compression Springs):</strong> Sıkıştırma kuvvetine direnç gösterir. En yaygın kullanılan tiptir. Amortisörler, valfler ve düğmelerde kullanılır.</li>\n            <li><strong>Çekme Yaylar (Extension Springs):</strong> Uzamaya karşı direnç gösterir. Uçlarında kancalar bulunur. Trambolinler ve garaj kapılarında görülür.</li>\n            <li><strong>Kurma Yaylar (Torsion Springs):</strong> Dönme kuvveti (tork) depolar. Mandallar ve kapı kolları örnektir.</li>\n        </ul>\n\n        <h3>Dikkat Edilmesi Gereken Parametreler</h3>\n        <ol>\n            <li><strong>Yay Çapı (D):</strong> Yayın dış çapı, montaj yapılacak yuvaya uygun olmalıdır.</li>\n            <li><strong>Tel Çapı (d):</strong> Tel kalınlığı arttıkça yayın sertliği (katsayısı) artar.</li>\n            <li><strong>Serbest Boy (L0):</strong> Yayın yüksüz haldeki boyudur.</li>\n        </ol>\n\n        <p>Aktif Yay olarak özel projeleriniz için teknik çizim desteği sunuyor ve en uygun yayı tasarlamanıza yardımcı oluyoruz.</p>\n      ",
    "titleEn": "How to Choose the Right Spring? Comprehensive Guide",
    "descriptionEn": "Do you need a compression spring or an extension spring for your project? Basic parameters to consider in spring calculations.",
    "contentEn": "\n        <h2>Which Spring Type Do You Need?</h2>\n        <p>Choosing the right spring in engineering projects is the first step for the efficient operation of the mechanism. Here are selection criteria according to spring types:</p>\n        \n        <ul>\n            <li><strong>Compression Springs:</strong> Resist compressive force. They are the most common type. Used in shock absorbers, valves, and buttons.</li>\n            <li><strong>Extension Springs:</strong> Resist stretching. They have hooks at their ends. Seen in trampolines and garage doors.</li>\n            <li><strong>Torsion Springs:</strong> Store rotational force (torque). Latches and door handles are examples.</li>\n        </ul>\n\n        <h3>Parameters to Consider</h3>\n        <ol>\n            <li><strong>Spring Diameter (D):</strong> The outer diameter of the spring must be suitable for the mounting slot.</li>\n            <li><strong>Wire Diameter (d):</strong> As wire thickness increases, the stiffness (rate) of the spring increases.</li>\n            <li><strong>Free Length (L0):</strong> The length of the spring without load.</li>\n        </ol>\n\n        <p>As Aktif Yay, we offer technical drawing support for your special projects and help you design the most suitable spring.</p>\n      ",
    "keywordsTr": "yay seçimi, basma yay, çekme yay, yay hesabı",
    "keywordsEn": "spring selection, compression spring, extension spring, spring calculation",
    "canonicalUrl": "",
    "robots": "index, follow",
    "metaTitleTr": "Yay Seçim Rehberi - Aktif Yay",
    "metaDescriptionTr": "Basma, çekme ve kurma yayları arasındaki farklar ve seçim kriterleri.",
    "metaTitleEn": "",
    "metaDescriptionEn": "",
    "ogTitleTr": "",
    "ogDescriptionTr": "",
    "ogTitleEn": "",
    "ogDescriptionEn": "",
    "ogImage": "",
    "image": "https://images.unsplash.com/photo-1542662565-7e5b6c239462?auto=format&fit=crop&q=80&w=2670",
    "imageAltTr": "Çeşitli endüstriyel metal yaylar",
    "imageAltEn": "Various industrial metal springs",
    "authorName": "Hasan Durmuş",
    "readingTime": 1,
    "isPublished": true,
    "viewCount": 84,
    "publishedAt": "2026-01-03T10:26:28.963Z",
    "createdAt": "2026-01-03T10:23:58.585Z",
    "updatedAt": "2026-01-03T10:26:28.967Z"
  }
]